OpenFOAMfiles/run/streetcanyon_parallel/LoD2/LAD02/broadleaf/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    y0
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          624;
        startFace       35596;
    }
    x0
    {
        type            patch;
        nFaces          260;
        startFace       36220;
    }
    y1
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          624;
        startFace       36480;
    }
    x1
    {
        type            patch;
        nFaces          260;
        startFace       37104;
    }
    terrain
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          960;
        startFace       37364;
    }
    sky
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          960;
        startFace       38324;
    }
)

// ************************************************************************* //
